In [2]:
import pandas as pd

routes = pd.read_csv("sweeden_data/routes.txt", dtype=str)

routes.head(10)

,route_id,agency_id,route_short_name,route_long_name,route_type,route_desc
0,9011001000100000,505000000000000001,1,NaN,700,NaN
1,9011001000200000,505000000000000001,2,NaN,700,NaN
2,9011001000300000,505000000000000001,3,NaN,700,NaN
3,9011001000400000,505000000000000001,4,NaN,700,NaN
4,9011001000500000,505000000000000001,5,NaN,700,NaN
5,9011001000600000,505000000000000001,6,NaN,700,NaN
6,9011001000700000,505000000000000001,7,Spårväg city,900,NaN
7,9011001001000000,505000000000000001,10,Blå linjen,401,NaN
8,9011001001100000,505000000000000001,11,Blå linjen,401,NaN
9,9011001001200000,505000000000000001,12,Nockebybanan,900,NaN

In [17]:
routes[routes["route_id"] == "9011001075800000"]

,route_id,agency_id,route_short_name,route_long_name,route_type,route_desc
448,9011001075800000,505000000000000001,758,NaN,700,NaN

In [4]:
trips = pd.read_csv("sweeden_data/trips.txt", dtype=str)

trips.head(10)

,route_id,service_id,trip_id,trip_headsign,direction_id,shape_id
0,9011001000100000,1,14010000635971836,NaN,1,1014010000482329256
1,9011001000100000,1,14010000664276317,NaN,1,1014010000482329256
2,9011001000100000,1,14010000664277726,NaN,1,1014010000482329256
3,9011001000100000,1,14010000664279606,NaN,1,1014010000482329256
4,9011001000100000,2,14010000664285753,NaN,1,1014010000482329256
5,9011001000100000,3,14010000664280574,NaN,1,1014010000482329256
6,9011001000100000,3,14010000664286186,NaN,1,1014010000482329256
7,9011001000100000,3,14010000664276697,NaN,1,1014010000482329256
8,9011001000100000,3,14010000664277107,NaN,1,1014010000482329256
9,9011001000100000,3,14010000664278217,NaN,1,1014010000482329256

In [ ]:
#Trip ids qui fonctionnent
trips_ids = [
    "14010000549855211", # route -> 9011001075200000 || Bus 752 || route type 700
    "14010000549855266",# route -> 9011001075800000 || Bus 758 || route type 700
    "",
    "",
    "",
    "",
    "",
    "",
    "",
]

In [16]:
trips[trips["trip_id"] == "14010000549855266"]

,route_id,service_id,trip_id,trip_headsign,direction_id,shape_id
91056,9011001075800000,54,14010000549855266,NaN,0,1014010000527068180

In [6]:
stops = pd.read_csv("sweeden_data/stops.txt", dtype=str)

stops.head(100)

,stop_id,stop_name,stop_lat,stop_lon,location_type,parent_station,platform_code
0,1,Stockholm Centralstation,59.331537,18.054943,1,NaN,NaN
1,2,Göteborg Centralstation,57.709299,11.973659,1,NaN,NaN
2,3,Malmö Centralstation,55.608777,13.000216,1,NaN,NaN
3,4,Alvesta station,56.898911,14.556790,1,NaN,NaN
4,5,Uppsala Centralstation,59.857739,17.647666,1,NaN,NaN
...,...,...,...,...,...,...,...
95,105,Ånge bstn,62.523485,15.659747,1,NaN,NaN
96,106,"Glasblåsarvägen, Kosta",56.853746,15.396088,1,NaN,NaN
97,107,Grästorp resecentrum,58.334619,12.684733,1,NaN,NaN
98,108,Strängnäs Resecentrum,59.371158,17.026022,1,NaN,NaN
99,109,Fristad station,57.827087,13.008897,1,NaN,NaN

In [7]:
stop_areas = pd.read_csv("sweeden_data/stop_areas.txt", dtype=str)

stop_areas.head(10)

     area_id stop_id
0  100000351   58365
1  510000027   73197
2  510000051   73034
3  510000119   73195
4  510000139   73192
5  510000177   73196
6  510000937   73048
7  510005320   73057
8  540099998   73035
9  740000001       1

In [20]:
# A prendre quand j'aurais la ligne idéale
shapes = pd.read_csv("sweeden_data/shapes.txt", dtype=str)

shapes.head(10)

,shape_id,shape_pt_lat,shape_pt_lon,shape_pt_sequence,shape_dist_traveled
0,1014010000482329256,59.341873,18.118316,1,0
1,1014010000482329256,59.341853,18.118402,2,0.01
2,1014010000482329256,59.341754,18.118334,3,12
3,1014010000482329256,59.341259,18.118047,4,69
4,1014010000482329256,59.340929,18.116765,5,151
5,1014010000482329256,59.340944,18.116478,6,167
6,1014010000482329256,59.340571,18.115033,7,259
7,1014010000482329256,59.340453,18.114870,8,276
8,1014010000482329256,59.340353,18.114259,9,312
9,1014010000482329256,59.341099,18.113851,10,397.99

In [9]:
agency = pd.read_csv("sweeden_data/agency.txt", dtype=str)

agency.head(10)

,agency_id,agency_name,agency_url,agency_timezone,agency_lang,agency_fare_url
0,50,Samtrafiken i Sverige AB,https://www.resrobot.se/,Europe/Stockholm,sv,NaN
1,500000000000000183,Norrtåg AB,https://www.resrobot.se/,Europe/Stockholm,sv,NaN
2,505000000000000001,AB Storstockholms Lokaltrafik,https://www.resrobot.se/,Europe/Stockholm,sv,NaN
3,505000000000000003,UL,https://www.resrobot.se/,Europe/Stockholm,sv,NaN
4,505000000000000004,Sörmland,https://www.resrobot.se/,Europe/Stockholm,sv,NaN
5,505000000000000005,Östgötatrafiken,https://www.resrobot.se/,Europe/Stockholm,sv,NaN
6,505000000000000006,Jönköpings Länstrafik,https://www.resrobot.se/,Europe/Stockholm,sv,NaN
7,505000000000000007,Länstrafiken Kronoberg,https://www.resrobot.se/,Europe/Stockholm,sv,NaN
8,505000000000000008,Kalmar Länstrafik,https://www.resrobot.se/,Europe/Stockholm,sv,NaN
9,505000000000000009,Region Gotland,https://www.resrobot.se/,Europe/Stockholm,sv,NaN

In [10]:
bus_routes = routes[routes["route_type"] == "700"]
bus_routes.head(10)

,route_id,agency_id,route_short_name,route_long_name,route_type,route_desc
0,9011001000100000,505000000000000001,1,NaN,700,NaN
1,9011001000200000,505000000000000001,2,NaN,700,NaN
2,9011001000300000,505000000000000001,3,NaN,700,NaN
3,9011001000400000,505000000000000001,4,NaN,700,NaN
4,9011001000500000,505000000000000001,5,NaN,700,NaN
5,9011001000600000,505000000000000001,6,NaN,700,NaN
30,9011001005000000,505000000000000001,50,NaN,700,NaN
31,9011001005300000,505000000000000001,53,NaN,700,NaN
32,9011001005400000,505000000000000001,54,NaN,700,NaN
33,9011001005500000,505000000000000001,55,NaN,700,NaN

In [11]:
bus_routes_test = bus_routes[bus_routes['route_long_name'].notna()]

bus_routes_test.head()

,route_id,agency_id,route_short_name,route_long_name,route_type,route_desc
537,9011001091200000,505000000000000001,12,Ersätter Nockebybanan,700,NaN
538,9011001092000000,505000000000000001,21B,Ersätter Lidingöbanan,700,NaN
541,9011001092500000,505000000000000001,25M,Ersätter Saltsjöbanan,700,NaN
542,9011001092600000,505000000000000001,26M,Ersätter Saltsjöbanan,700,NaN
543,9011001093000000,505000000000000001,30,Ersätter Tvärbanan,700,NaN